cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

cask 'xquartz'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'gawk'
brew 'grc'
# brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'yq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
# brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']

#cask '1password'
#cask 'firefox'
#cask 'google-chrome'
#cask 'vlc'

cask 'docker'
brew 'docker-compose'
brew 'docker-completion'
